Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.Order
Order of connected elements.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.CodeChecking
States if connection type has the automatic code checking implemented.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.CategoryId
Category of connection elements which use that connection type (most common OST_StructConnections).
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.Description
Description of connection type.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.ConnectionGroup
Connection Group name
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.Name
Name of connection type.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.ConnectionTypeGuid
Unique identifier representing connection type.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.SetDetailedPreviewImage(System.Windows.Media.Imaging.BitmapImage)
Sets the detailed preview image.
image: System::Windows::Media::Imaging::BitmapImage image to be set.
Since: 2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.SetPreviewImage(System.Windows.Media.Imaging.BitmapImage)
Sets the preview image.
image: System::Windows::Media::Imaging::BitmapImage image to be set.
Since: 2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.#ctor(System.Guid)
Constructs a new instance of StructuralConnectionTypeInfoData.
guid:
The unique identifier of connection type.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData
The data describing given connection type, needed by Structural Connections Provider server.
Remarks:
It's exposed in internal API.
Since:
2017